ОТЧЁТ ПО ЛАБОРАТОРНОЙ РАБОТЕ Тема:

Разработка консольного приложения «Финансовый калькулятор»

Цель работы:

Освоить основы разработки консольных приложений на языке Python, научиться обрабатывать пользовательский ввод, выполнять математические расчёты по формулам и работать с файлами для записи результатов и логирования ошибок.

Задание:

Разработать консольное приложение «Финансовый калькулятор», которое:

Запрашивает у пользователя:

сумму вклада;

годовую процентную ставку;

срок вклада (в годах). Выполняет расчёт итоговой суммы по формуле сложных процентов S=P×(1+nr​)n×t где:

P — начальная сумма (вклад),

r — годовая ставка (в долях),

n — количество начислений в год (принять = 12),

t — срок вклада (в годах).

Обрабатывает возможные ошибки:

неверный ввод данных (например, буквы вместо чисел);

отрицательные значения;

деление на ноль или другие вычислительные ошибки.

Записывает результаты в файл result.txt.

Реализует логирование ошибок в файл errors.log.

Ход работы:

Разработка программы
Был написан следующий код на языке Python: import datetime

def calculate_compound_interest(P, r, t, n=12): """Расчёт итоговой суммы по формуле сложных процентов""" try: if P <= 0 or r <= 0 or t <= 0: raise ValueError("Все значения должны быть положительными")

    r = r / 100  # Преобразуем ставку в доли
    S = P * (1 + r / n) ** (n * t)
    return S

except Exception as e:
    log_error(f"Ошибка при расчете: {e}")
    return None
def log_error(message): """Запись ошибок в файл errors.log""" with open("errors.log", "a", encoding="utf-8") as f: timestamp = datetime.datetime.now().strftime("%Y-%m-%d %H:%M:%S,%f")[:-3] f.write(f"{timestamp} - ERROR - {message}\n")

def main(): try: # Ввод данных пользователем P = float(input("Введите сумму вклада: ")) r = float(input("Введите годовую ставку (%): ")) t = float(input("Введите срок вклада (в годах): "))

    # Расчёт
    S = calculate_compound_interest(P, r, t)

    if S is not None:
        print(f"\nИтоговая сумма через {int(t)} лет: {S:.2f} тенге")
        print("Работа программы завершена.\n")

        # Запись результата в result.txt
        with open("result.txt", "a", encoding="utf-8") as file:
            file.write(
                f"\nВклад: {P} тг\n"
                f"Ставка: {r}%\n"
                f"Срок: {int(t)} лет\n"
                f"Итоговая сумма: {S:.2f} тг\n"
            )

except ValueError:
    log_error("Ошибка при вводе: необходимо ввести числовые значения")
    print("Ошибка: введите числовые значения.")
except ZeroDivisionError:
    log_error("Ошибка при расчете: деление на ноль")
    print("Ошибка: деление на ноль.")
except Exception as e:
    log_error(f"Неизвестная ошибка: {e}")
    print("Произошла ошибка. Проверьте данные и попробуйте снова.")
if name == "main": main() 2. Пример работы программы

Ввод пользователя: Введите сумму вклада: 200000 Введите годовую ставку (%): 15 Введите срок вклада (в годах): 5

Вывод на экран: Итоговая сумма через 5 лет: 421436.27 тенге Работа программы завершена.

Файл result.txt: Вклад: 200000 тг Ставка: 15.0% Срок: 5 лет Итоговая сумма: 421436.27 тг

Файл errors.log (пример при ошибке): 2025-10-29 13:25:31,456 - ERROR - Ошибка при расчете: Все значения должны быть положительными

Тестирование программы

№	Входные данные (P, r, t)	Ожидаемый результат	Результат программы	Ошибка
1	200000,15,5	421436.27 тг	421436.27 тг	Нет
2	-50000, 10, 2	Ошибка ввода	Ошибка в логах	Да
3	abc, 5, 2	Ошибка формата	Ошибка в логах	Да
Вывод:

В ходе лабораторной работы было разработано консольное приложение «Финансовый калькулятор», реализующее:

ввод данных пользователем;

расчёт сложных процентов по заданной формуле;

обработку ошибок и исключений;

запись результатов в файл;

логирование ошибок в отдельный журнал.

Программа успешно выполняет поставленные задачи и демонстрирует основы работы с вводом, математическими операциями и файловой системой на языке Python.